using System;

namespace laba6
{
    class Program
    {
        static void Main(string[] args)
        {
            // 7 в. - знайти середне арифметичне кожного другого додатнього парного елемента в кожному рядку;
            int p = 3;
            int[,] m = {{ 1, 4, 3},
                        { 4, 6, 6},
                        { 7, -4, 9} };


            // операція умови            
            int n;
            if ((m[0, 1] % 2 == 0) && (m[0, 1] > 0)) //перевірка першого члена
            {
                if ((m[1, 1] % 2 == 0) && (m[1, 1] > 0)) //перевірка другого члена
                {
                    if ((m[2, 1] % 2 == 0) && (m[2, 1] > 0)) //перевірка третього члена
                    {
                        n = (m[0, 1] + m[1, 1] + m[2, 1]) / 3;
                        Console.WriteLine($"Середнє арифметичне чисел {m[0, 1]}, {m[1, 1]} i {m[2, 1]}  = {n}");
                    }
                    else
                    {
                        n = (m[0, 1] + m[1, 1]) / 2;
                        Console.WriteLine($"Середнє арифметичне чисел {m[0, 1]} i {m[1, 1]} = {n}");
                    }
                }
                else
                {
                    n = (m[0, 1] + m[1, 1]) / 2;
                    Console.WriteLine($"Тiльки число {m[0, 1]} вiдповiдає вимогам");
                }

            }
            else if ((m[1, 1] % 2 == 0) && (m[1, 1] > 0))
            {
                if ((m[2, 1] % 2 == 0) && (m[2, 1] > 0))
                {
                    n = (m[1, 1] + m[2, 1]) / 2;
                    Console.WriteLine($"Середнє арифметичне чисел {m[1, 1]} i {m[2, 1]}  = {n}");
                }
                else
                {
                    n = (m[0, 1] + m[1, 1]) / 2;
                    Console.WriteLine($"Тiльки число {m[1, 1]} вiдповiдає вимогам");
                }
            }
            else
            {
                if ((m[2, 1] % 2 == 0) && (m[2, 1] > 0))
                {
                    n = m[2, 1];
                    Console.WriteLine($"Лише число {m[2, 1]} вiдповiдає вимогам{n}");
                }
            }

                     
            
            //Вивід масиву
            Console.WriteLine("Масив ");
           
            for (int i = 0; i < p; i++)
            {
                for (int j = 0; j < p; j++)
                {
                    Console.Write($"{m[i, j]}\t");
                }
                Console.WriteLine();
            }
            
            
        }
    }
}
